//;******************************************************************************
//;* Copyright (c) 1983-2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//;
//; Module Name:
//;
//;   GenericBdsStrings.uni
//;
//; Abstract:
//;
//;   GenericBdsLib
//;
//;
///** @file
//
//  String definitions for Boot Option description.
//
//  Copyright (c) 2010 - 2013, Intel Corporation. All rights reserved.<BR>
//  This program and the accompanying materials
//  are licensed and made available under the terms and conditions of the BSD License
//  which accompanies this distribution.  The full text of the license may be found at
//  http://opensource.org/licenses/bsd-license.php
//
//  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
//  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
//**/

/=#

#include "Standard.uni"

//
// If add language for these boot type, the description of boot option variable will be update to corresponding language
// when PlatformLang variable is changed.
//
#string STR_DESCRIPTION_FLOPPY         #language en-US  "EFI Floppy"
#string STR_DESCRIPTION_CD_DVD         #language en-US  "EFI DVD/CDROM"
#string STR_DESCRIPTION_HDD            #language en-US  "EFI Hard Drive"
#string STR_DESCRIPTION_USB            #language en-US  "EFI USB Device"
#string STR_DESCRIPTION_SCSI           #language en-US  "EFI SCSI Device"
#string STR_DESCRIPTION_ISCSI          #language en-US  "EFI ISCSI Device"
#string STR_DESCRIPTION_SDMMC          #language en-US  "EFI SD/MMC Card"
#string STR_DESCRIPTION_EMMC           #language en-US  "EFI Embedded MMC Device"
#string STR_DESCRIPTION_MISC           #language en-US  "EFI Misc Device"
#string STR_DESCRIPTION_NETWORK        #language en-US  "EFI Network"
#string STR_DESCRIPTION_NON_BLOCK      #language en-US  "EFI Non-Block Boot Device"
#string STR_DESCRIPTION_SHELL          #language en-US  "EFI Internal Shell"

#string STR_MISSING_STRING	            #language en-US  "Missing String"
                       	               #language fr-FR  "Missing String"

#string STR_MISC_BIOS_VERSION          #language en-US  "Fake Data"
#string STR_MISC_SYSTEM_PRODUCT_NAME   #language en-US  "H2O"
#string STR_CCB_VERSION                #language en-US  "Fake Data"

#string STR_BIOS_VERSION_STRING        #language en-US  "InsydeH2O Version"
                                       #language fr-FR  "Version d'InsydeH2O"
                                       #language zh-TW  "\wide系微\narrow EFI \wide版本\narrow"
                                       #language ja-JP  "InsydeH2O\wideバージョン\narrow"
                                       #language it-IT  "Versione InsydeH2O"
                                       #language es-ES  "Versión de InsydeH2O"
                                       #language de-DE  "InsydeH2O-Version"
                                       #language pt-PT  "Versão de Insyde H2O"

#string STR_BIOS_BUILD_DATE            #language en-US  "BIOS Build Date"
                                       #language fr-FR  "BIOS Build Date"
                                       #language zh-TW  "BIOS\wide建立日期\narrow"
                                       #language ja-JP  "BIOS\wide作成日\narrow"
                                       #language it-IT  "Data di build del BIOS"
                                       #language es-ES  "Fecha de BIOS Buile"
                                       #language de-DE  "BIOS-Buile-Daten"
                                       #language pt-PT  "Data da BIOS Buile"

#string STR_CPU_TYPE_STRING            #language en-US  "Processor Type"
                                       #language fr-FR  "Type de Procédure"
                                       #language zh-TW  "\wide處理器\narrow \wide型式\narrow"
                                       #language ja-JP  "\wideプロセッサの種類\narrow"
                                       #language it-IT  "Tipo di processore"
                                       #language es-ES  "Tipo de Procesador"
                                       #language de-DE  "Prozessor-Typ"
                                       #language pt-PT  "Tipo de Processor"

#string STR_SYSTEM_MEMORY_SPEED_STRING #language en-US  "System Memory Speed"
                                       #language fr-FR  "Vitesse de Mémoire Système"
                                       #language zh-TW  "\wide系統記憶體速度\narrow"
                                       #language ja-JP  "\wideシステムメモリの速度\narrow"
                                       #language it-IT  "Velocita-ITA` memoria sistema"
                                       #language es-ES  "Velocidad de Memoria de Sistema"
                                       #language de-DE  "Systemspeicher Geschwindigkeit"
                                       #language pt-PT  "Velocidade de Memória de Sistema"

#string STR_RECOVERY_FLASH_TITLE       #language en-US  "Do you want to recovery ROM part?"
                                       #language fr-FR  "Voulez-vous récupérer ROM part? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language zh-TW  "\wide是否回復快閃記憶體內容\narrow? \wide(警告: 並非所有的作業系統皆可在回復模式下開機)\narrow"
                                       #language ja-JP  "\wideロム部分を回復しますか\narrow? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language it-IT  "Vuoi effettuare il recovery della ROM? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language es-ES  "Quiere recuperar la parte ROM? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language de-DE  "Möchten Sie ROM-Teile rückgewinnen? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language pt-PT  "Você quer fazer recuperação da parte ROM ? Caution: Not every OS is bootable in Recovery Mode.)"

#string STR_RECOVERY_FLASH_STATUS      #language en-US  "Flash Status"
                                       #language fr-FR  "Statut Flash"
                                       #language zh-TW  "\wide快閃記憶體狀態\narrow"
                                       #language ja-JP  "\wideフラッシュ状態\narrow"
                                       #language it-IT  "Stato Flash"
                                       #language es-ES  "Estados de la Flash"
                                       #language de-DE  "Aufleuchtstatus"
                                       #language pt-PT  "Status da Flash"

#string STR_RECOVERY_FLASH_YES         #language en-US  "YES,this choice will flash Rom part."
                                       #language fr-FR  "Oui, ce choix renouvellera Rom part."
                                       #language zh-TW  "\wide是，此選項將更新快閃記憶體內容\narrow"
                                       #language ja-JP  "\wideはい、ロム部分をフラッシュにする\narrow"
                                       #language it-IT  "YES, questa scelta avvia la programmazione della ROM."
                                       #language es-ES  "Si, esta opción se flasheara la parte de Rom."
                                       #language de-DE  "Ja, dieses wird ROM-Teil wählen"
                                       #language pt-PT  "Sim, esta escolha irá piscar a parte de Rom"

#string STR_RECOVERY_FLASH_RESETSYSTEM #language en-US  "NO, abort Recovery mode and restart system."
                                       #language fr-FR  "NO, abort Recovery mode and restart system."
                                       #language zh-TW  "\wide否，取消回復模式並重新啟動系統\narrow"
                                       #language ja-JP  "NO, abort Recovery mode and restart system."
                                       #language it-IT  "NO, abort Recovery mode and restart system."
                                       #language es-ES  "NO, abort Recovery mode and restart system."
                                       #language de-DE  "NO, abort Recovery mode and restart system."
                                       #language pt-PT  "NO, abort Recovery mode and restart system."

#string STR_RECOVERY_FLASH_NO          #language en-US  "NO, boot to OS now."
                                       #language fr-FR  "NON, démarrez à OS maintenant."
                                       #language zh-TW  "\wide否，現在開機進入作業系統\narrow"
                                       #language ja-JP  "\wideいいえ、今\narrowOS\wideを起動する\narrow"
                                       #language it-IT  "NO, avvia l'OS adesso"
                                       #language es-ES  "No, iniciar sistema operativo ahora."
                                       #language de-DE  "Nein, nun Aufpusch zu OS"
                                       #language pt-PT  "NÃO boot para o OS agora"

#string STR_RECOVERY_FLASH_REBOOT      #language en-US  "Rebooting !"
                                       #language fr-FR  "Redémarrez!"
                                       #language zh-TW  "\wide重新開機\narrow!"
                                       #language ja-JP  "\wide再起動中\narrow!"
                                       #language it-IT  "Riavvio!"
                                       #language es-ES  "Reiniciar!"
                                       #language de-DE  "Wiederaufpuschen!"
                                       #language pt-PT  "Reiniciando!"

#string STR_MEMORY_TEST_PERCENT        #language en-US  "% of the system memory tested OK"
                                       #language fr-FR  "% de la mémoire de système essayée D'ACCORD"
                                       #language zh-TW  "%\wide之系統記憶體已測試無誤\narrow"
                                       #language ja-JP  "\wideシステムメモリ\narrow%\wide検査をパスした\narrow"
                                       #language it-IT  "% della memoria di sistema controllata OK"
                                       #language es-ES  "% de la memoria del sistema testeado OK"
                                       #language de-DE  "% des Speichersystems i.O. getestet"
                                       #language pt-PT  "% Da memória do sistema testado OK"
#string STR_BOOT_SUCCEEDED             #language en-US  "Boot Succeeded - "
                                       #language fr-FR  "Démarrage Réussi"
                                       #language zh-TW  "\wide開機成功\narrow"
                                       #language ja-JP  "\wideブート成功\narrow"
                                       #language it-IT  "Boot OK"
                                       #language es-ES  "Arranque satisfactorio"
                                       #language de-DE  "Aufladung erfolgreich"
                                       #language pt-PT  "Boot Sucedido"

#string STR_AUTO_FAILOVER_DISABLE_BOOT_FAIL  #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key.\nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_AUTO_FAILOVER_NO_BOOT_DEVICE     #language en-US  "Default Boot Device Missing or Boot Failed.\nInsert Recovery Media and Hit any key \nThen Select 'Boot Manager' to choose a new Boot Device or to Boot Recovery Media"
#string STR_BOOT_FAILED_BY_SECURITY         #language en-US  " has been blocked by the current security policy."
                                            #language fr-FR  " has been blocked by the current security policy."
                                            #language zh-TW  " has been blocked by the current security policy."
                                            #language ja-JP  " has been blocked by the current security policy."
                                            #language it-IT  " has been blocked by the current security policy."
                                            #language es-ES  " has been blocked by the current security policy."
                                            #language de-DE  " has been blocked by the current security policy."
                                            #language pt-PT  " has been blocked by the current security policy."
#string STR_BOOT_FILE_FAILED_BY_SECURITY    #language en-US  "Execution of the selected file has been blocked by the current security policy."
                                            #language fr-FR  "Execution of the selected file has been blocked by the current security policy."
                                            #language zh-TW  "Execution of the selected file has been blocked by the current security policy."
                                            #language ja-JP  "Execution of the selected file has been blocked by the current security policy."
                                            #language it-IT  "Execution of the selected file has been blocked by the current security policy."
                                            #language es-ES  "Execution of the selected file has been blocked by the current security policy."
                                            #language de-DE  "Execution of the selected file has been blocked by the current security policy."
                                            #language pt-PT  "Execution of the selected file has been blocked by the current security policy."
#string STR_COMMON_BOOT_FAILED              #language en-US  " boot failed."
                                            #language fr-FR  " boot failed."
                                            #language zh-TW  " boot failed."
                                            #language ja-JP  " boot failed."
                                            #language it-IT  " boot failed."
                                            #language es-ES  " boot failed."
                                            #language de-DE  " boot failed."
                                            #language pt-PT  " boot failed."
#string STR_COMMON_BOOT_FILE_FAILED         #language en-US  "Execution of the selected file boot failed."
                                            #language fr-FR  "Execution of the selected file boot failed."
                                            #language zh-TW  "Execution of the selected file boot failed."
                                            #language ja-JP  "Execution of the selected file boot failed."
                                            #language it-IT  "Execution of the selected file boot failed."
                                            #language es-ES  "Execution of the selected file boot failed."
                                            #language de-DE  "Execution of the selected file boot failed."
                                            #language pt-PT  "Execution of the selected file boot failed."